ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fg6425.h
#define MPYM_0              (0x0000)  /* Multiplier mode: MPY */
#define MPYM_1              (0x0010)  /* Multiplier mode: MPYS */
#define MPYM_2              (0x0020)  /* Multiplier mode: MAC */
#define MPYM_3              (0x0030)  /* Multiplier mode: MACS */
#define MPYM__MPY           (0x0000)  /* Multiplier mode: MPY */
#define MPYM__MPYS          (0x0010)  /* Multiplier mode: MPYS */
#define MPYM__MAC           (0x0020)  /* Multiplier mode: MAC */
#define MPYM__MACS          (0x0030)  /* Multiplier mode: MACS */

/************************************************************
* Operational Amplifier
************************************************************/
#define __MSP430_HAS_OA_0__           /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_OA_0__ 0x0AE0
#define OA_0_BASE __MSP430_BASEADDRESS_OA_0__

#define OA0CTL0_              0x0AE0    /* OA0 Control register 0 */
sfrb(OA0CTL0_L , OA0CTL0_);
sfrb(OA0CTL0_H , OA0CTL0_+1);
sfrw(OA0CTL0, OA0CTL0_);
#define OA0PSW_               0x0AE2    /* OA0 Positive Input Terminal Switches */
sfrb(OA0PSW_L , OA0PSW_);
sfrb(OA0PSW_H , OA0PSW_+1);
sfrw(OA0PSW, OA0PSW_);
#define OA0NSW_               0x0AE4    /* OA0 Negative Input Terminal Switches */
sfrb(OA0NSW_L , OA0NSW_);
sfrb(OA0NSW_H , OA0NSW_+1);
sfrw(OA0NSW, OA0NSW_);
#define OA0GSW_               0x0AEE    /* OA0 Ground Switches */
sfrb(OA0GSW_L , OA0GSW_);
sfrb(OA0GSW_H , OA0GSW_+1);
sfrw(OA0GSW, OA0GSW_);

#define OAM                  (0x0001)  /* Amplifier mode selection */
#define OARRI                (0x0020)  /* Rail-to-rail input enable */
#define OARRIRDY             (0x0040)  /* Rail-to-rail input ready status */

#define OAM_L               (0x0001)  /* Amplifier mode selection */
#define OARRI_L             (0x0020)  /* Rail-to-rail input enable */
#define OARRIRDY_L          (0x0040)  /* Rail-to-rail input ready status */


#define PSW0                (0x0001)  /* Positive input terminal switch 0 control */
#define PSW1                (0x0002)  /* Positive input terminal switch 1 control */
#define PSW2                (0x0004)  /* Positive input terminal switch 2 control */
#define PSW3                (0x0008)  /* Positive input terminal switch 3 control */

#define PSW0_L              (0x0001)  /* Positive input terminal switch 0 control */
#define PSW1_L              (0x0002)  /* Positive input terminal switch 1 control */
#define PSW2_L              (0x0004)  /* Positive input terminal switch 2 control */
#define PSW3_L              (0x0008)  /* Positive input terminal switch 3 control */


#define NSW0                (0x0001)  /* Negative input terminal switch 0 control */
#define NSW1                (0x0002)  /* Negative input terminal switch 1 control */
#define NSW2                (0x0004)  /* Negative input terminal switch 2 control */
#define NSW3                (0x0008)  /* Negative input terminal switch 3 control */
#define NSW4                (0x0010)  /* Negative input terminal switch 4 control */

#define NSW0_L              (0x0001)  /* Negative input terminal switch 0 control */
#define NSW1_L              (0x0002)  /* Negative input terminal switch 1 control */
#define NSW2_L              (0x0004)  /* Negative input terminal switch 2 control */
#define NSW3_L              (0x0008)  /* Negative input terminal switch 3 control */
#define NSW4_L              (0x0010)  /* Negative input terminal switch 4 control */


#define GSW0                (0x0001)  /* Ground switch 0 */
#define GSW1                (0x0002)  /* Ground switch 1 */

#define GSW0_L              (0x0001)  /* Ground switch 0 */
#define GSW1_L              (0x0002)  /* Ground switch 1 */


/************************************************************
* Operational Amplifier
************************************************************/
#define __MSP430_HAS_OA_1__           /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_OA_1__ 0x0AF0
#define OA_1_BASE __MSP430_BASEADDRESS_OA_1__

#define OA1CTL0_              0x0AF0    /* OA1 Control register 0 */
sfrb(OA1CTL0_L , OA1CTL0_);
sfrb(OA1CTL0_H , OA1CTL0_+1);
sfrw(OA1CTL0, OA1CTL0_);
#define OA1PSW_               0x0AF2    /* OA1 Positive Input Terminal Switches */
sfrb(OA1PSW_L , OA1PSW_);
sfrb(OA1PSW_H , OA1PSW_+1);
sfrw(OA1PSW, OA1PSW_);
#define OA1NSW_               0x0AF4    /* OA1 Negative Input Terminal Switches */
sfrb(OA1NSW_L , OA1NSW_);
sfrb(OA1NSW_H , OA1NSW_+1);
sfrw(OA1NSW, OA1NSW_);
#define OA1GSW_               0x0AFE    /* OA1 Ground Switches */
sfrb(OA1GSW_L , OA1GSW_);
sfrb(OA1GSW_H , OA1GSW_+1);
sfrw(OA1GSW, OA1GSW_);

/************************************************************
* DIGITAL I/O Port1/2 Pull up / Pull down Resistors
************************************************************/
#define __MSP430_HAS_PORT1_R__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT1_R__ 0x0200
#define P1_BASE __MSP430_BASEADDRESS_PORT1_R__
#define __MSP430_HAS_PORT2_R__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT2_R__ 0x0200
#define P2_BASE __MSP430_BASEADDRESS_PORT2_R__
#define __MSP430_HAS_PORTA_R__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORTA_R__ 0x0200
#define PA_BASE __MSP430_BASEADDRESS_PORTA_R__
#define __MSP430_HAS_P1SEL__          /* Define for DriverLib */
#define __MSP430_HAS_P2SEL__          /* Define for DriverLib */
#define __MSP430_HAS_PASEL__          /* Define for DriverLib */

#define PAIN_                 0x0200    /* Port A Input */
const_sfrb(PAIN_L , PAIN_);
const_sfrb(PAIN_H , PAIN_+1);
const_sfrw(PAIN, PAIN_);
#define PAOUT_                0x0202    /* Port A Output */
sfrb(PAOUT_L , PAOUT_);
sfrb(PAOUT_H , PAOUT_+1);
sfrw(PAOUT, PAOUT_);
#define PADIR_                0x0204    /* Port A Direction */
sfrb(PADIR_L , PADIR_);
sfrb(PADIR_H , PADIR_+1);
sfrw(PADIR, PADIR_);
#define PAREN_                0x0206    /* Port A Resistor Enable */
sfrb(PAREN_L , PAREN_);
sfrb(PAREN_H , PAREN_+1);
sfrw(PAREN, PAREN_);
#define PADS_                 0x0208    /* Port A Drive Strenght */
sfrb(PADS_L , PADS_);
sfrb(PADS_H , PADS_+1);
sfrw(PADS, PADS_);
#define PASEL_                0x020A    /* Port A Selection */
sfrb(PASEL_L , PASEL_);
sfrb(PASEL_H , PASEL_+1);
sfrw(PASEL, PASEL_);
#define PAIES_                0x0218    /* Port A Interrupt Edge Select */
sfrb(PAIES_L , PAIES_);
sfrb(PAIES_H , PAIES_+1);
sfrw(PAIES, PAIES_);
#define PAIE_                 0x021A    /* Port A Interrupt Enable */
sfrb(PAIE_L , PAIE_);
sfrb(PAIE_H , PAIE_+1);
sfrw(PAIE, PAIE_);
#define PAIFG_                0x021C    /* Port A Interrupt Flag */
sfrb(PAIFG_L , PAIFG_);
sfrb(PAIFG_H , PAIFG_+1);
sfrw(PAIFG, PAIFG_);





















#define P1IV_                 0x020E    /* Port 1 Interrupt Vector Word */
sfrw(P1IV, P1IV_);
#define P2IV_                 0x021E    /* Port 2 Interrupt Vector Word */
sfrw(P2IV, P2IV_);
#define P1IN                (PAIN_L)  /* Port 1 Input */
#define P1OUT               (PAOUT_L) /* Port 1 Output */
#define P1DIR               (PADIR_L) /* Port 1 Direction */
#define P1REN               (PAREN_L) /* Port 1 Resistor Enable */
#define P1DS                (PADS_L)  /* Port 1 Drive Strenght */
#define P1SEL               (PASEL_L) /* Port 1 Selection */
#define P1IES               (PAIES_L) /* Port 1 Interrupt Edge Select */
#define P1IE                (PAIE_L)  /* Port 1 Interrupt Enable */
#define P1IFG               (PAIFG_L) /* Port 1 Interrupt Flag */

//Definitions for P1IV
#define P1IV_NONE            (0x0000)    /* No Interrupt pending */
#define P1IV_P1IFG0          (0x0002)    /* P1IV P1IFG.0 */
#define P1IV_P1IFG1          (0x0004)    /* P1IV P1IFG.1 */
#define P1IV_P1IFG2          (0x0006)    /* P1IV P1IFG.2 */
#define P1IV_P1IFG3          (0x0008)    /* P1IV P1IFG.3 */
#define P1IV_P1IFG4          (0x000A)    /* P1IV P1IFG.4 */
#define P1IV_P1IFG5          (0x000C)    /* P1IV P1IFG.5 */
#define P1IV_P1IFG6          (0x000E)    /* P1IV P1IFG.6 */
#define P1IV_P1IFG7          (0x0010)    /* P1IV P1IFG.7 */


#define P2IN                (PAIN_H)  /* Port 2 Input */
#define P2OUT               (PAOUT_H) /* Port 2 Output */
#define P2DIR               (PADIR_H) /* Port 2 Direction */
#define P2REN               (PAREN_H) /* Port 2 Resistor Enable */
#define P2DS                (PADS_H)  /* Port 2 Drive Strenght */
#define P2SEL               (PASEL_H) /* Port 2 Selection */
#define P2IES               (PAIES_H) /* Port 2 Interrupt Edge Select */
#define P2IE                (PAIE_H)  /* Port 2 Interrupt Enable */
#define P2IFG               (PAIFG_H) /* Port 2 Interrupt Flag */

//Definitions for P2IV
#define P2IV_NONE            (0x0000)    /* No Interrupt pending */
#define P2IV_P2IFG0          (0x0002)    /* P2IV P2IFG.0 */
#define P2IV_P2IFG1          (0x0004)    /* P2IV P2IFG.1 */
#define P2IV_P2IFG2          (0x0006)    /* P2IV P2IFG.2 */
#define P2IV_P2IFG3          (0x0008)    /* P2IV P2IFG.3 */
#define P2IV_P2IFG4          (0x000A)    /* P2IV P2IFG.4 */
#define P2IV_P2IFG5          (0x000C)    /* P2IV P2IFG.5 */
#define P2IV_P2IFG6          (0x000E)    /* P2IV P2IFG.6 */
#define P2IV_P2IFG7          (0x0010)    /* P2IV P2IFG.7 */



/************************************************************
* DIGITAL I/O Port3/4 Pull up / Pull down Resistors
************************************************************/
#define __MSP430_HAS_PORT3_R__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT3_R__ 0x0220
#define P3_BASE __MSP430_BASEADDRESS_PORT3_R__
#define __MSP430_HAS_PORT4_R__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT4_R__ 0x0220
#define P4_BASE __MSP430_BASEADDRESS_PORT4_R__
#define __MSP430_HAS_PORTB_R__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORTB_R__ 0x0220
#define PB_BASE __MSP430_BASEADDRESS_PORTB_R__
#define __MSP430_HAS_P3SEL__          /* Define for DriverLib */
#define __MSP430_HAS_P4SEL__          /* Define for DriverLib */
#define __MSP430_HAS_PBSEL__          /* Define for DriverLib */

